// Спробуйте відгадати які відповіді ви отримаєте, якщо запустите це в
// Console у Google Chrome. Як тільки ви отримаєте відповідь на запитання
// перевірити їх, скопіювавши їх і запустивши в консолі, рядок за рядком


//Розв'яжіть усі вирази наведені нижче:

// додайте змінну "firstName" та "lastName"
let firstName = "Andrew";
let lastName = "Pasoshnikov";
let fullName = firstName + " " + lastName;
console.log(fullName); 
//таким чином, щоб вийшло Ваше повне ім'я

// створіть змінну, у якій збергіається відповідь (повне ім'я)
// для "firstName" + " " + "lastName"

// Розв'яжіть завдання. Скільки буде a + b?
var a = 34;
var b = 21;
a = 2;
a + b // Яка відпоідь тут?
console.log("a + b = ", a + b); 
// Чому дорівнює c?
var c;
console.log("Чому дорівнює c - ", c); 
